<template>
	<view class="main">
		<template v-if="type == 1">
			<view class="container">
				<view>
					用户协议
				</view>
				<text>请您本产品之前，请务必仔细阅读并理解《用户许可使用协议》（以下简称“本协议”）中规定的多有权利和限制。
					我们一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）不受到任何侵犯。
					本协议（包括本文最后部分的隐私政策）是用户（包括通过各种合法途径获取到本产品的自然人、法人或其他组织机构，以下简称“用户”或“您”）与我们之间针对本产品相关事项最终的、完整的且排他的协议，并取代、合并之前的当事人之间关于上述事项的讨论和协议。
					本协议将对用户使用本产品的行为产生法律约束力，您已承诺和保证有权利和能力订立本协议。用户开始使用本产品将视为已经接受本协议，请认真阅读并理解本协议中各种条款，包括免除和限制我们的免责条款和对用户的权利限制（未成年人审阅时应由法定监护人陪同），如果您不能接受本协议中的全部条款，请勿开始使用本产品。
					使用账户
				</text>
				<view>您必须承诺和保证：</view>
				<view>1. 您使用本产品的行为必须合法 </view>
				本产品将会依据本协议“修改和终止”的规定保留或终止您的账户。您必须承诺对您的登录信息保密、不被其他人获取与使用，并且对您在本账户下的所有行为负责。您必须将任何有可能触犯法律的、未授权使用或怀疑为未授权使用的行为在第一时间通知本产品。本产品不对您因未能遵守上述要求而造成的损失承担法律责任。
				终端用户协议许可
				依据本协议规定，本产品将授予您以下不可转让的、非排他的许可：
				<view>1.使用本产品的权利；</view>
				<view>2.在您所有的网络通信设备、计算机设备和移动通信设备上下载、安装、使用本产品的权利。限制性条款</view>
				<view>本协议对您的授权将受到以下限制：</view>
				<view>1. 您不得对本产品进行任何形式的许可、出售、租赁、转让、发行或其他商业用途；</view>
				<view>2. 除非法律禁止此类限制，否则您不得对本产品的任何部分或衍生产品进行修改、翻译、改编、合并、利用、分解、改造或反向编译、反向工程等；</view>
				<view>3. 您不得以创建相同或竞争服务为目的使用本产品；</view>
				<view>4. 除非法律明文规定，否则您不得对本产品的任何部分以任何形式或方法进行生产、复制、发行、出售、下载或显示等；</view>
				<view>5. 您不得删除或破坏包含在本产品中的任何版权声明或其他所有权标记。</view>
				费用
				您必须自行负担购买本产品的费用，个人上网或第三方（包括但不限于电信或移动通讯提供商）收取的通讯费、信息费等相关费用。如涉及电信增值服务，我们建议您与增值服务提供商确认相关费用问题。
				版本
				任何本产品的更新版本或未来版本、更新或者其他变更将受到本协议约束。
				遵守法律
				您同意遵守《中华人民共和国合同法》、《中华人民共和国著作权法》及其实施条例、《全国人民代表大会常务委员会关于维护互联网安全的决定》（“人大安全决定”）、《中华人民共和国保守国家秘密法》、《中华人民共和国电信条例》（“电信条例“）、《中华人民共和国计算机信息系统安全保护条例》、《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法、《计算机信息系统国际联网保密管理规定》、《互联网信息服务管理办法》、《计算机信息网络国际联网安全保护管理办法》、《互联网电子公告服务管理规定》（“电子公告规定”）等相关中国法律法规的任何及所有的规定，并对以任何方式使用您的密码和您的账号使用本服务的任何行为及其结果承担全部责任。如违反《人大安全决定》有可能构成犯罪，被追究刑事责任。《电子公告规定》则有明文规定，上网用户使用电子公告服务系统对所发布的信息负责。《电信条例》也强调，使用电信网络传输信息的内容及其后果由电信用户负责。在任何情况下，如果本网站有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反上述法律和法规的任何规定，本网站可在任何时候不经任何事先通知终止向您提供服务。
				用户内容
				<view>1.用户内容是指该用户下载、发布或以其他方式使用本产品时产生的所有内容（例如：您的信息、图片、音乐或其他内容）。</view>
				<view>2.您是您的用户内容唯一的责任人，您将承担因您的用户内容披露而导致的您或任何第三方被识别的风险。</view>
				<view>3.您已同意您的用户内容受到权利限制（详见“权利限制”）</view>
				权利限制
				您已同意通过分享或其他方式使用本产品中的相关服务，在使用过程中，您将承担因下述行为所造成的风险而产生的全部法律责任：
				<view>1.破坏宪法所确定的基本原则的；</view>
				<view>2.危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；</view>
				<view>3.损害国家荣誉和利益的；</view>
				<view>4.煽动民族仇恨、民族歧视，破坏民族团结的；</view>
				<view>5.破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
				<view>6.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
				<view>7.侮辱或者诽谤他人，侵害他人合法权益的；</view>
				<view>8.含有法律、行政法规禁止的其他内容的。</view>
				<view>您已经同意不在本产品从事下列行为：</view>
				<view>1.发布或分享电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；</view>
				<view>2.未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等；</view>
				<view>3.用自动化的方式恶意使用本产品，给服务器造成过度的负担或以其他方式干扰或损害网站服务器和网络链接；</view>
				<view>4.在未授权的情况下，尝试访问本产品的服务器数据或通信数据；</view>
				<view>5.干扰、破坏本产品其他用户的使用。</view>
				<view>修改和终止</view>
				修改
				本协议容许变更。如果本协议有任何实质性变更，我们将通过电子邮件来通知您。变更通知之后，继续使用本产品则为您已知晓此类变更并同意条款约束；
				我们保留在任何时候无需通知而修改、保留或关闭本产品任何服务之权利；
				您已同意我们无需因修改、保留或关闭本产品任何服务之权利；
				您已同意我们无需因修改、保留或关闭本产品任何服务的行为对您或第三方承担责任。
				<view>终止</view>
				本协议自您接受之日起生效，在您使用本产品的过程中持续有效，直至依据本协议终止；
				尽管有上述规定，如果您使用本产品的时间早于您接受本协议的时间，您在此知晓并同意本协议于您接受本协议的时间，您在此知晓并同意本协议于您第一次使用本产品时生效，除非依据本协议提前终止；
				我们可能会依据法律的规定，保留您使用本产品或者本账户的权利；无论是否通知，我们将在任何时间以任何原因终止本协议，包括出于善意的相信您违反了我们可接受使用政策或本协议的其他规定；
				不受前款规定所限，如果用户侵犯第三人的版权且我们接到版权所有人或版权所有人的合法代理人的通知后，我们保留终止本协议的权利；
				一旦本协议终止，您使用本产品的权利即告终止。您应当知晓您的产品终止意味着您的用户内容将从我们的活动数据库中删除。我们不因终止本协议对您承担任何责任，包括终止您的用户账户和删除您的用户内容。
				<view>第三方</view>
				<view>您已知晓或同意我们的部分服务时基于第三方的技术支持获得；</view>
				<view>您已知晓本协议是您在与我们之前签订，而非您与上述第三方之间签订。我们是基于本产品所产生的内容、维护、支持服务、保证和由此产生的诉讼等事项的唯一责任人。您已同意遵守且授权给本产品限制您有条件地使用本产品的服务。</view>
				第三方信息和服务
				<view>1.本产品包含了第三方的部分信息和服务。我们不控制且不对第三方的信息和服务负责；</view>
				<view>2.我们仅为您使用方便的目的或为承诺和保证第三方的需要而提供此类信息和服务；</view>
				<view>3.用户需对使用第三方信息和服务产生的风险承担法律责任；</view>
				<view>4.当用户访问第三方信息和服务时，适用第三方的条款和政策。</view>
				<view>赔偿</view>
				<view>您已同意无害地使用本产品，避免因下述行为或相关行为遭受来第三方的任何投诉、诉讼、损失、损害、责任、成本和费用（包括律师费）：</view>
				<view>1.用户使用本产品的行为；</view>
				<view>2.用户的用户内容；</view>
				<view>3.用户违反本协议的行为。</view>
				我们保留专属抗辩权和请求赔偿的权利
				您已同意，除非获得我们书面同意，您不得在您与我们共同对第三方提起的诉讼中单方和解。
				我们将尽合理努力将此类诉讼、诉讼行为或进程通知您。
				在任何情况下，本产品都不对您或任何第三方因本协议产生的任何间接性、后果性、惩罚性的、偶然的、特殊或惩罚性的损害赔偿承担责任。访问、使用本产品所产生的损坏计算机系统或移动通讯设备数据的风险将由您个人承担。
				适用法律
				本协议适用中华人民共和国法律；
				如果双方发生纠纷，应本着友好的圆柱协商解决；如协商不成，应向所在地的法院提起诉讼。
				独立性
				本协议中的某些条款因故无法适用，则本协议的其他条款继续适用且无法适用的条款将会被修改，以便其能够依法适用。
				完整性
				本协议（包括隐私政策）是您和本产品之间关于本产品相关事项的最终的、完整的、排他的协议，且取代和合并之前当事人关于此类事项（包括之前的最终用户许可、服务条款和隐私政策）的讨论和协议；
				每部分的题目只为阅读之便而无任何法律或合同义务；
				除非我们书面同意，您不得转让本协议所规定的权利义务。任何违反上述规定企图转让的行为均无效。

				<view>隐私政策</view>
				本应用非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。
				本app尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更优质的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。
				<view>1. 适用范围</view>
				<view>(a) 在您注册本应用app帐号时，您根据app要求提供的个人注册信息；</view>
				<view>(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；</view>
				<view>(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。</view>
				<view>(d)本应用严禁用户发布不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。</view>
				<view>2. 信息使用</view>
				<view>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。如果我们存储发生维修或升级，我们会事先发出推送消息来通知您，请您提前允许本应用消息通知。</view>
				<view>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。</view>
				<view>(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。</view>
				<view>3. 信息披露</view>
				<view>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</view>
				<view>(a) 未经您事先同意，我们不会向第三方披露；</view>
				<view>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</view>
				<view>(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</view>
				<view>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</view>
				<view>(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</view>
				<view>4. 信息存储和交换</view>
				<view>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。</view>
				<view>5. Cookie的使用</view>
				<view>(a) 在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。</view>
				<view>(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。</view>
				<view>(c) 通过本应用所设cookies所取得的有关信息，将适用本政策。</view>
				<view>6.本隐私政策的更改</view>
				<view>(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。</view>
				<view>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。</view>
				<view>方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。
					感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感谢您的信任！</view>
			</view>
		</template>
		<template v-else>
			<view class="container">
				<view class="">
					欢迎阅读宜陆网隐私声明（下称本声明）。本声明适用您在宜陆网无偿或有偿使用宜陆网产品（包括但不限于网站，APP等宜陆网产品）。宜陆网是上海宜陆信息科技有限公司（下称宜陆公司）运营的网站，本声明所述的宜陆网产品为宜陆公司旗下产品。
					在使用宜陆网产品前，请您务必仔细阅读并透彻理解本声明，在确认充分理解并同意后使用相关产品。一旦您开始使用宜陆网各项产品，即表示您已充分理解并同意本声明。如对本声明内容有任何疑问、意见或建议，您可通过宜陆网提供的各种联系方式与宜陆公司联系。
					宜陆公司承诺尊重和保护您的隐私，并将此作为宜陆公司事业活动的基础和社会责任及义务。因此在您访问宜陆网网站时，宜陆公司会尽力帮助您维护互联网个人数据的控制权。
				</view>
				<view>
					1.对您的信息的收集</view>
				<view>为向您提供更好的服务，宜陆公司会要求您在进行注册宜陆网用户、产品购买、产品购买后应监管部门要求进行实名认证、在线咨询等情况下提供您的姓名(或名称)、地址、联络方式及身份证等有效证件信息，以便我们为您提供快速准确的优质服务。
				</view>
				<view class="">
					2.对您的信息的使用</view>
				<view class="">您提供的信息将受到严格保密，宜陆公司使用您的信息只是为了更全面地了解您的需要并为您提供更佳的服务。在一些情况下，可能还会用您的信息与您取得联系以进行市场调查或为您提供我们认为您可能感兴趣的市场信息。
					若宜陆公司将信息用于本声明未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
					如宜陆公司停止运营宜陆网产品或服务，宜陆公司将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对宜陆公司所持有的与已关停业务相关的个人信息进行删除或匿名化处理。
				</view>
				<view class="">
					3.对您的信息的控制</view>
				<view class="">当您通过注册或其它方式向宜陆公司提供您的信息时，宜陆公司不会把您的信息共享、转让或出租给他人。您的许可总被首先保障，宜陆公司不会向任何不代表宜陆公司的第三方透露您的信息。除非根据法律、法规或监管部门按法律执行，宜陆公司不会在未经您事先知晓或许可的情况下，以与上述内容无关的方式随意使用或分享您提供给宜陆公司的信息。
					宜陆公司可能会将收集到的您的信息与来自第三方的数据进行整理或合并，并用于向您推广产品或服务。
					宜陆公司可能委托授权合作伙伴为您提供某些服务，宜陆公司仅会出于本隐私声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且不得将此信息用于其他任何目的。
					在宜陆公司发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，宜陆公司会要求新的持有您个人信息的公司、组织继续受本隐私声明的约束，否则宜陆公司将要求该公司、组织和个人重新向您征求授权同意。
				</view>
				<view class="">4.对您的信息的进入或修改</view>
				<view class="">宜陆公司为了保护您的隐私和安全，将采取合理的措施验证身份，之后，您才能进入或修改您的信息。宜陆公司力求使您的信息保持准确，并为您提供了包括使您能够在线访问您的信息、注册数据的能力，使您可以更新或修改您的信息。请注意，从宜陆网到第三方网站的链接仅作为一种方便服务提供给您，如果使用这些链接，您将离开宜陆网，而第三方网站可能会收集与您有关的个人身份信息。因此，宜陆网对第三方网站及其任何信息、软件或其他产品、材料、或因使用它们而可能获得的任何结果不予认可，也不作任何陈述和保证。
				</view>
				<view class="">5.您的信息的安全性</view>
				<view class="">宜陆公司已采取合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。您的数据将被存放在有密码控制的服务器中，因而任何对您资料的访问都将受到限制并被严格保护。
					在不幸发生个人信息安全事件后，宜陆公司将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、宜陆公司已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况宜陆公司将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，宜陆公司会采取合理、有效的方式发布公告。
					同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。</view>

				<view class="">6.您的信息的披露</view>
				<view class="">您充分知晓，以下情形中，宜陆公司共享、转让、公开披露您的个人信息无需事先征得您的授权同意：</view>
				<view class="">（1）与国家安全、国防安全有关的；</view>
				<view class="">（2）与公共安全、公共卫生、重大公共利益有关的；</view>
				<view class="">（3）与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；</view>
				<view class="">（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
				<view class="">（5）您自行向社会公众公开的个人信息；</view>
				<view class="">（6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</view>
				<view class="">（7）保护宜陆公司及其客户的权利、财产，包括协议的执行和遵守适用于服务的策略；</view>
				<view class="">（8）保护宜陆公司及其雇员、客户和公众的权利、财产或安全。</view>

				<view class="">请知悉，根据适用的法律，若宜陆公司对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。</view>

				<view class="">7.Cookie技术的使用</view>
				<view class="">随着互联网对各项新技术的应用，宜陆公司为访客带来了完全个性化的体验。宜陆公司会使用Cookies的技术来分析网页的使用情形。Cookie是放置在您的电脑硬盘中的一段要求权限的文字。使用此项技术并不表示宜陆公司可自动获悉有关您的任何信息。宜陆公司可以确定您使用的计算机类型，但使用Cookies的主要目的还在于使您在访问宜陆网网站时获得更佳的体验。
					同时您也拥有完全的自主权，可以将网络浏览器设置为通知您Cookie的放置请求，或者完全拒绝Cookie。您可以删除包含Cookie的文件。这些文件被保存为Internet浏览器的一部分。</view>

				<view class="">8.如何处理未成年人的信息</view>
				<view class="">宜陆公司推定您具有相应的民事行为能力。如您为未成年人，宜陆公司要求您请您的父母或监护人仔细阅读本隐私声明，并在征得您的父母或监护人同意的前提下使用宜陆公司的服务、产品或向宜陆公司提供信息。</view>
				<view class="">对于经父母或监护人同意使用宜陆公司的产品或服务而收集未成年人个人信息的情况，宜陆公司只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。</view>

				<view class="">9.本声明的更改</view>
				<view class="">本声明的解释权归结于宜陆公司，宜陆公司可能适时修订本隐私声明的条款，该修订构成本隐私声明的一部分。如该等修订造成您在本隐私声明下权利的实质减少，宜陆公司将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用宜陆公司的服务，即表示同意受经修订的本隐私声明的约束。</view>

				<view class="">10.管辖与法律适用</view>
				<view class="">本隐私声明的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</view>
				<view class="">若您和宜陆公司发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本隐私声明签订地（中国上海市奉贤区）有管辖权的人民法院管辖。</view>
				<view class="">本声明自公布时生效。</view>

				<view class="">以上声明，您可随时在宜陆网平台阅读、复制或下载。</view>
			</view>
		</template>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				type: 1,
			};
		},
		onLoad(options) {
			console.log('zxczxczxczxczx', options.type)
			this.type = options.type ? options.type : 1
			if (options.type == 1) {
				uni.setNavigationBarTitle({
					title: '用户协议'
				})
			} else {
				uni.setNavigationBarTitle({
					title: '隐私政策'
				})
			}
		}
	}
</script>

<style lang="scss">
	.main {
		padding: $uni-spacing-col-lg $uni-spacing-row-sm;
	}

	.container {
		padding: 20rpx 30rpx;
	}
</style>
